nightStarLights/ESP32_N16R8_Template/sdkconfig.defaults.esp32s3
# This file was generated using idf.py save-defconfig or menuconfig [D] key. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) 6.1.0 Project Minimal Configuration
#
# default:
CONFIG_IDF_TARGET="esp32s3"

#
# Bootloader config
#
CONFIG_BOOTLOADER_COMPILER_OPTIMIZATION_PERF=y
# end of Bootloader config

#
# Serial flasher config
#
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
# end of Serial flasher config

#
# Partition Table
#
CONFIG_PARTITION_TABLE_CUSTOM=y
# end of Partition Table

#
# Compiler options
#
CONFIG_COMPILER_OPTIMIZATION_PERF=y
# end of Compiler options

#
# Component config
#

#
# Bluetooth
#
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

#
# Controller Options
#
CONFIG_BT_CTRL_BLE_MAX_ACT=2
# end of Controller Options
# end of Bluetooth

#
# ESP HTTPS server
#
CONFIG_ESP_HTTPS_SERVER_ENABLE=y
CONFIG_ESP_HTTPS_SERVER_CERT_SELECT_HOOK=y
# end of ESP HTTPS server

#
# ESP PSRAM
#
CONFIG_SPIRAM=y

#
# SPI RAM config
#
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_TYPE_ESPPSRAM64=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y
# end of SPI RAM config
# end of ESP PSRAM

#
# ESP-STDIO
#
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_BAUDRATE=921600
# end of ESP-STDIO

#
# ESP System Settings
#

#
# CPU frequency
#
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y

#
# Cache config
#
CONFIG_ESP32S3_INSTRUCTION_CACHE_32KB=y
CONFIG_ESP32S3_DATA_CACHE_64KB=y
# end of Cache config
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
# end of ESP System Settings

#
# Core dump
#
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
# end of Core dump

#
# FreeRTOS
#
CONFIG_FREERTOS_HZ=1000
# end of FreeRTOS
# end of Component config

CONFIG_IDF_EXPERIMENTAL_FEATURES=y
